export default [
    {id: 1,
        question: ' የረሱል (ሰዐወ) እናት ማን ትባላለች?',
        options: [
            "አሚና",
            'ሐዋ',
            'ሱመያ ረዲአላሁ አንሀ '
        ]
    },
    {
        id: 2,
        question: 'የረሱል (ሰ.ዐ.ወ) አባት ማን ይባላሉ?',
        options: [
            "ሀምዛ RA",
            "አብደልህ",
            "አቡ ጣሊብ"
        ]
    },
    {
        id: 3,
        question: "የረሱል(ሰ.ዐ.ወ) ስም ትክክለኛው ቅደም ተከተል የትኛው ነው?",
        options: [
            'ሙሐመድ ቢን ሀሺም ቢን አብደላህ ቢን አብዱልመናፍ ቢን ቁሰይ ቢን ኪላብ',
            'ሙሐመድ ቢን አብደላህ ቢን አብዱልሙጣሊብ ቢን ሀሺም ቢን አብዱልመናፍ ቢን ቁሰይ ቢን ኪላብ ﷺ',
            'ሙሐመድ ቢን አብጣሊብ ቢን ሀሺም ቢን ኪላብ ቢን ቁሰይ ቢን አብዱልመናፍ'
        ]
    },
    {
        id: 4,
        question: "የረሱል (ሰ.ዐ.ወ) ነገድ ስም ማን ይባላል?",
        options: [
           ' በኑ ነድር ፣',
            'በኑ ዘህራ፣',
            'ቁረይሽ'
        ]
    },
    {
        id: 5,
        question: "ከቁረይሽ የመጀመሪያው የካአባ አስተዳዳሪ ማን ነበር?",
        options: [
            'ሀሺም',
            'ቁሴይ',
            "አቡላሀብ"
        ]
    },
    {
        id: 6,
        question: "የረሱል(ሰ.ዐ.ወ) የቤተሰብ ስም ማን ነው?",
        options: [
            'ኪናና',
            'ቁሪሺ',
            "ሀሺሚያ"
        ]
    }, 
    {
         id: 7,
    question: 'የረሱል (ሰ.ዐ.ወ) አያት አላህ 10 ወንድ ልጆች ከሰጣቸዉ አንዱን እንደሚያርዱ ተስለዉ አላህ በሰጣቸዉ ጊዜ ሊታረድ አጣ የወጣበት ማን ነበር?',
    options: [
        "ሀምዛ RA",
        "አብደላህ",
        "አቡ ጣሊብ"
    ]
},
{
    id: 8,
    question: "ረሱል (ሰ.ዐ.ወ) ኢብን ዘቢሀይን ይባላሉ ዘቢሀይን እነማን ናቸው?",
    options: [
        "አብደላህ እና ኢብራሂም አሰ",
        "አብደላህ እና እስማኤል አሰ",
       ' ሙሳ እና ኢብራሂም አሰ'
    ]
},
{
    id: 9,
    question: 'ለዘቢሀይን ለእያንዳንዱ የተደረገው መስዋዕት(እርድ) ምን ያህል ነው?',
    options: [
        "አንድ በግ እና 50 ፍየሎች",
        "ሁለት በጎች እና 40 ፍየሎች",
        "አንድ በግ  እና 100 ግመሎች"
    ]
},
{
    id: 10,
    question: 'የረሱል (ሰዐወ) እናትን ረሱል ሰለላሁ ዐለይሂ ወሰለምን ያዋለደትዉ ማን ናት?',
    options: [
        'ኑሴባ',
        "ሸፋ ቢንት አምር",
        "ዘይነብ ቢንት ጀህሽ"
    ]
},
{
    id: 11,
    question: 'የረሱል (ሰ.ዐ.ወ) አባት  በስንት አመታቸዉ ነው የሞቱባቸዉ?',
    options: [
        "በሁለት ዓመታቸዉ",
        "በ 12 ዓመታቸው",
        "ከመወለዳቸዉ በፊት"
    ]
},
{
    id: 12,
    question: 'የረሱል ሰለላሁ ዓለይሂ ወሰለም ሞግዚት ነበረች',
    options: [
        'አሙ አይመን በረከቱል ሀበሺያ',
        'ሱመያ RA',
        "ዘይነብ"
    ]
},
{
    id: 13,
        question: ' በወቅቱ በአረብ ባህል መሰረት ህጻናት ተወስደው ለገጠር ሴቶች ተሰጥተው  ጡት እንዲጠቡ ይደረጋሉ፡ በዚህ መሰረት ረሱል ሰለላሁ አለይሂ ወሰለም ወስዳ ጡት ያጠባቻቸዉ ማን ናት?',
        options: [
            "ሀሊማ",
            'ሱወይባ',
            'ሩቂያ'
        ]
    },
{
    id: 14,
        question: 'ረሱል ሰለላሁ ዐለይሂ ወሰለም በገጠር ለምን ያህል ጊዜ ቆዩ?',
        options: [
            '2 ዓመታት',
            '4 ዓመታት',
            "10 ዓመታት"
        ]
    },
    {
        id: 15,
        question: 'ረሱል ሰለላሁ ዐለይሂ ወሰለም የተወለዱበት ቀን?',
        options: [
            "ራቢል አወል 9 የዝሆን አመት",
            "ሸባን 9 የዝሆን ዓመት",
            'ረመዳን 15'
        ]
    }, 
    {
        id: 16,
        question: 'ረሱል ሰለላሁ ዐለይሂ ወሰለም በገጠር በነበሩበት ወቅት የገጠር ቤተሰቦቻቸዉን ወደ እውነተኛ ወላጃቸዉ እንዲመልሱ ያስገደዳቸውና ያስፈራቸው ምን ነገር ተፈጠረ?',
        options: [
            'ተላላፊ በሽታ',
            'ድርቅ',
            "የልባቸዉ ቀዶ ጥገና"]


}, 
{id: 17,
question: 'የረሱል ሰለላሁ ዓለይሂ ወሰለም እናት የሞተችው በስንት አመታቸዉ ነው?',
options: [
    "በ9 ዓመታቸዉ",
    "በ 3 ዓመታቸዉ",
    "በ 6 ዓመታቸዉ"
]
},
{
id: 18,
question: 'የረሱል ሰለላሁ ዓለይሂ ወሰለም እናት ሞተችበትና የተቀበረችበት ቦታ ማን ይባላል?',
options: [
    'ቤኪ',
    "አቡዋ",
    'የስሪብ'
]
}, 
{
id: 19,
        question: 'ረሱል ሰለላሁ ዐለይሂ ወሰለም የመንከባከብ ኃላፊነት የተወጡት የረሱል (ሰዐወ) አያት ከሞቱ በኋላ ማን ናቸዉ?',
        options: [
            "አቡጣሊብ",
            "ሀምዛ RA",
            'ሀሊማ'
        ]
    },
    {

        id: 20,
        question: 'ካባን ሊያፋርስ 60 ሺህ ወታደሮችን እና ዝሆኖችን ይዞ የሄደ ሰው ማን ይባላል?',
        options: [
            'ገብረ ሥላሴ',
            "አብርሀ",
            'አክራ'
        ]
    },
    {
        id: 21,
        question: 'ረሱል ሰለላሁ ዐለይሂ ወሰለም ለክድጃ በነጋዴነት ይሠሩ ነበር ከሳቸዉ ጋር የተጓዘዉና ያየውን አስገራሚ ነገር የሚነግራት የነበረዉ ባሪያዋ ማን ይባላል?',
        options: [
            "አቡ ሰላማ",
            'መይሰራ',
            "ቢላል RA"
        ]
    },{

    id: 22,
        question: 'አንድ መነኩሴ ረሱል ሰለላሁ ዐለይሂ ወሰለም ነብይ እንደሚሆኑበት ከቁረይሽ ለመጡ ነጋዴዎች ተናግሮ ነበር፡ ስሙ ማን ይባላል?',
        options: [
            "ቡሄይራ",
            'ካሊድ',
            "አቡ ጣሊብ"
        ]
    },
    {
        id: 23,
        question: 'ንግግሩን ለማረጋገጥ ምን ማስረጃ ሰጣቸው?',
        options: [
            "በጀርባው ላይ የአላህ መልእክተኞች ምልክት የሆነ ማህተም እንዳለበት",
            "ተክሎችና ድንጋዮች ሁሉ በመጡ ጊዜ ሱጁድ ሲያደርጉለት እንዳየ",
            'ሁሉም'
        ]
    },{
        id: 24,
    question: 'ረሱል ሰለላሁ ዐለይሂ ወሰለም ሀያ አመት ሲሞላቸው ቁሬይሽ እና ኪናና በአንድ በኩል ከቀይሱ ኢላን በሌላ በኩል  ጦርነት ተደርጎ ነበር። የጦርነቱ ስም ማን ይባላል?',
    options: [
        'አሁድ',
        "ሀርበል ፉጃር",
        "አህዛብ"
    ]
 },
   
 {
    id: 25,
    question: 'ነቢዩ ሰለላሁ ዐለይሂ ወሰለም ከክድጃ ጋር ስንት ልጆች ነበሯቸው?',
    options: [
       '4 ወንዶች እና 2 ሴት ልጆች',
        '4 ሴት ልጆች እና 2 ወንድ ልጆች',
        "ኢብራሂም ብቻ"
    ]
 }
     
];
export const answers = [0, 1, 1, 2, 1,2,1,1,2,1,2,0,0,1,0,2,2,1,0,1,1,0,2,1,1];